teddokano/mcx-arduino-core/hardware/nxp/mcx/variants/frdm_mcxa153/include/r01lib_spi.h
/*
 *  @author Tedd OKANO
 *
 *  Released under the MIT license License
 */

#ifndef R01LIB_SPI_H
#define R01LIB_SPI_H

extern "C" {
#ifdef	CPU_MCXC444VLH
#include "fsl_spi.h"
#else
#include "fsl_lpspi.h"
#endif
}

#include	"io.h"

#define	SPI_FREQ		1'000'000UL


/** SPI class
 *	
 *  @class SPI
 *
 *	A class for demonstrating SPI bus
 */

class SPI : public Obj
{
public:
	
	/** Create a SPI instance with specified pins
	 *
	 * @param mosi (option) pin number to connect MOSI
	 * @param miso (option) pin number to connect MISO
	 * @param sclk (option) pin number to connect SCLK
	 * @param cs (option) pin number to connect CS
	 */
	SPI( int mosi = D11, int miso = D12, int sclk = D13, int cs = D10 );
	
	/** Destractor to freeing SPI resource
	 */
	virtual ~SPI();

	/** Frequency settings
	 * 
	 * @param frequency (option) define default SCLK frequency
	 */
	virtual void	frequency( uint32_t frequency = SPI_FREQ );

	/** mode setting
	 *	SPI bus mode setting
	 *	mode 0 = CPOL:0, CPHA:0
	 *	mode 1 = CPOL:0, CPHA:1
	 *	mode 2 = CPOL:1, CPHA:0
	 *	mode 3 = CPOL:1, CPHA:1
	 *  
	 * @param mode selecting mode 0~3
	 */
	virtual void	mode( uint8_t mode = 0 );

	/** Bit order setting
	 *
	 * @param order 0 = LSB first, non-zero = MSB first (matches Arduino's
	 *              LSBFIRST=0/MSBFIRST=1 convention)
	 */
	virtual void	bit_order( uint8_t order );

	/** SPI peripheral's input clock, in Hz -- the reference frequency() is
	 *  divided down from.
	 */
	uint32_t	clock_freq( void ) const { return master_clk_freq; }

	/** Data transfer on SPI
	 *  
	 * @param wp data to write
	 * @param rp data buffer for read
	 * @param length transfer length
	 */	
	virtual status_t		write( uint8_t *wp, uint8_t *rp, int length );

	/** Fast scalar single-byte transfer.
	 *
	 *  Bypasses write()'s generic blocking-transfer per-call overhead
	 *  (disable/flush-FIFO/clear-status-flags/re-enable), which dominates
	 *  cost for a single 8-bit frame -- this exists for callers that move
	 *  data one byte at a time in a tight loop (e.g. the standard Arduino
	 *  SD library's spiRec()/spiSend()).
	 *
	 * @param out byte to transmit
	 * @return byte received
	 */
	virtual uint8_t			transfer_byte( uint8_t out );

	/** variable for reporting last state */
	status_t				last_status;

#ifdef	CPU_MCXC444VLH
protected:
	DigitalOut				chip_select;
private:
	spi_master_config_t		masterConfig;
	SPI_Type				*unit_base;
#else
	lpspi_master_config_t	masterConfig;
	LPSPI_Type				*unit_base;
#endif
	
	uint32_t				master_clk_freq;
	uint32_t				master_pcs_4_xfer;
};

#endif // R01LIB_SPI_H
